Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_OFF (24u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_LEN (1u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_OFF (25u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_LEN (1u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_OFF (26u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_LEN (1u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_OFF (27u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_LEN (1u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_OFF (28u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_LEN (1u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_OFF (29u)

/** \brief Length for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_LEN (11u)

/** \brief Mask for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_OFF (0u)

/** \brief Length for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_LEN (7u)

/** \brief Mask for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_OFF (16u)

/** \brief Length for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_LEN (11u)

/** \brief Mask for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_OFF (0u)

/** \brief Length for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_OFF (0u)

/** \brief Length for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_OFF (1u)

/** \brief Length for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_OFF (2u)

/** \brief Length for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_OFF (16u)

/** \brief Length for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_OFF (17u)

/** \brief Length for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_OFF (18u)

/** \brief Length for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_LEN (7u)

/** \brief Mask for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_OFF (0u)

/** \brief Length for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_OFF (15u)

/** \brief Length for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_LEN (7u)

/** \brief Mask for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_OFF (16u)

/** \brief Length for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_LEN (1u)

/** \brief Mask for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_OFF (31u)

/** \brief Length for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_LEN (8u)

/** \brief Mask for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_OFF (0u)

/** \brief Length for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_LEN (8u)

/** \brief Mask for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_OFF (8u)

/** \brief Length for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_LEN (8u)

/** \brief Mask for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_OFF (16u)

/** \brief Length for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_LEN (8u)

/** \brief Mask for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_OFF (24u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_LEN (11u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_OFF (0u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_LEN (7u)

