Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_OFF (16u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_OFF (24u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_OFF (25u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_OFF (26u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_OFF (27u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_OFF (28u)

/** \brief Length for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_OFF (29u)

/** \brief Length for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_LEN (11u)

/** \brief Mask for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_OFF (0u)

/** \brief Length for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_LEN (7u)

/** \brief Mask for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_OFF (16u)

/** \brief Length for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_LEN (7u)

/** \brief Mask for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_OFF (24u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_LEN (11u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_OFF (0u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_LEN (6u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_OFF (16u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_OFF (24u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_OFF (25u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_OFF (26u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_OFF (27u)

/** \brief Length for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_LEN (1u)

/** \brief Mask for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_OFF (28u)

/** \brief Length for Ifx_ERAY_MBS_Bits.VFRA */
#define IFX_ERAY_MBS_VFRA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.VFRA */
#define IFX_ERAY_MBS_VFRA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.VFRA */
#define IFX_ERAY_MBS_VFRA_OFF (0u)

/** \brief Length for Ifx_ERAY_MBS_Bits.VFRB */
#define IFX_ERAY_MBS_VFRB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.VFRB */
#define IFX_ERAY_MBS_VFRB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.VFRB */
#define IFX_ERAY_MBS_VFRB_OFF (1u)

/** \brief Length for Ifx_ERAY_MBS_Bits.SEOA */
#define IFX_ERAY_MBS_SEOA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.SEOA */
#define IFX_ERAY_MBS_SEOA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.SEOA */
#define IFX_ERAY_MBS_SEOA_OFF (2u)

/** \brief Length for Ifx_ERAY_MBS_Bits.SEOB */
#define IFX_ERAY_MBS_SEOB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.SEOB */
#define IFX_ERAY_MBS_SEOB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.SEOB */
#define IFX_ERAY_MBS_SEOB_OFF (3u)

/** \brief Length for Ifx_ERAY_MBS_Bits.CEOA */
#define IFX_ERAY_MBS_CEOA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.CEOA */
#define IFX_ERAY_MBS_CEOA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.CEOA */
#define IFX_ERAY_MBS_CEOA_OFF (4u)

/** \brief Length for Ifx_ERAY_MBS_Bits.CEOB */
#define IFX_ERAY_MBS_CEOB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.CEOB */
#define IFX_ERAY_MBS_CEOB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.CEOB */
#define IFX_ERAY_MBS_CEOB_OFF (5u)

/** \brief Length for Ifx_ERAY_MBS_Bits.SVOA */
#define IFX_ERAY_MBS_SVOA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.SVOA */
#define IFX_ERAY_MBS_SVOA_MSK (0x1u)

